{
    "language": "日本語 (Japanese)",
    "lang_code": "jp",
    "title": "Mlog ドキュメント",
    "by": "By Yruei",
    "foreword": {
        "title": "序文",
        "content1": "このドキュメントは主に私が書いたものであるため、不正確または省略がある可能性があります。修正、追加、提案がある場合は、お気軽にご連絡ください。私の連絡先:",
        "issue": "or make an issue",
        "issue_link": "Here",
        "content2": "if you have any question about mlog, whether it is technical help or general question feel free to ask them in",
        "content3": ", people there will be happy to help you, (just dont ask to ask, just ask)",
        "content4": "There are some missing information in this documentation, which are identified by",
        "content5": "for people who want to contribute and complete them you can search for it by pressing ",
        "content6": ", or ",
        "content7": "Find in page",
        "content8": "for mobile devices."
    },
    "introduction": {
        "title": "Introduction",
        "title2": "What is Mindustry logic?",
        "content1": "Mindustry Logic (mlog) is a scripting language added in v6 for the purpose of introducing more advanced automation and strategy into the game  It is heavily inspired by Assembly languages, therefore the language is a low level language making it harder to understand (low level being low to machine language (Assembly, C, etc) and far from human language, high level language example are (Python, javaScript, C#, etc) if you have previous programming experience it's very easy to learn but people who are entirely new to programming might find this a little confusing.",
        "content2": "Fun fact, it is turing complete (meaning you can literally do anything a real computer can, although the practicality is questionable), it is often used for more advanced automation (telling units what to do, disabling/enabling blocks, and more), For more advanced people, they like to mess around just for fun making stuff that are not actually useful to campaign like games, emulators, renderings, etc.",
        "content3": "mlog is not necessary for the completion of campaign , it is very optional, often the time you spent coding will be more than if you just do it manually.."
    },
    "glossary": {
        "title": "Glossary",
        "title2": "Data types",
        "integers": "Integers",
        "content1": "are whole numbers, meaning no decimal, 1,2,3, are integers, 1.001, are not.",
        "intlimit": "integer limitations",
        "content2": "The largest integer that can be represented accurately in a single number in Mindustry (double-precision floating-point format) is",
        "max-power": "2^53",
        "which-equals": ", which equals ",
        "max-value": "9007199254740992",
        "range-separator": ". from",
        "min-power": "-2^53",
        "which-is": ", which is",
        "min-value": "-9007199254740992",
        "content3": "Beyond these limits, floating-point representation may lead to inaccuracies due to the way numbers are rounded."
    }
}